Autodesk.Revit.DB.ICustomFieldServerProxy.ValidateCustomFieldProperties(Autodesk.Revit.DB.ICustomFieldProperties,Autodesk.Revit.DB.ScheduleField)
Override this function to validate the custom field properties.
customFieldProperties:
An instance of Autodesk.Revit.DB.ICustomFieldProperties which represents the properties of this field.
scheduleField:
The field that is controlled by this server.
Returns:
If the properties are valid, an empty string should be returned.
If the properties are not valid, a non-empty string which describes the error should be returned.
This string will be thrown as ArgumentException message to the caller of
Autodesk::Revit::DB::CustomFieldData::SetCustomFieldProperties.
If this field doesn't have any properties, it should return a non-empty string
which says that this field doesn't have any properties.

Autodesk.Revit.DB.ICustomFieldServerProxy.SetCustomFieldProperties(Autodesk.Revit.DB.ICustomFieldProperties,Autodesk.Revit.DB.ScheduleField)
Override this function to set the custom field properties.
customFieldProperties:
An instance of Autodesk.Revit.DB.ICustomFieldProperties which represents the properties of this field.
It is guaranteed that the properties are valid. Before calling this function Revit called
Autodesk.Revit.DB.ICustomFieldServerProxy.ValidateCustomFieldProperties(Autodesk.Revit.DB.ICustomFieldProperties,Autodesk.Revit.DB.ScheduleField) and verified that it returned an empty string
(which means that the properties are valid).
scheduleField:
The field that is controlled by this server.

Autodesk.Revit.DB.ICustomFieldServerProxy.GetCustomFieldProperties(Autodesk.Revit.DB.ScheduleField)
Override this function to get the custom field properties.
scheduleField:
The field that is controlled by this server.
Returns:
Returns an instance of Autodesk.Revit.DB.ICustomFieldProperties.
If this field doesn't have any properties will return null.

Autodesk.Revit.DB.ICustomFieldServerProxy.GetCustomFieldGraphics(System.Collections.Generic.IList{Autodesk.Revit.DB.CustomFieldOneRowData},Autodesk.Revit.DB.ScheduleField)
Override this function to compute the graphics for the custom field.
Remarks:
This function is called only if this custom field has a custom graphic representation
This graphics will be shown when the schedule is placed on a sheet.
During the execution of this function the document can't be modified
rowsData:
A list where each item represents the data needed for computation for one row.
scheduleField:
The field that is controlled by this server.
Returns:
Returns a list of objects which contains the result of the computation.
The object at index ii should represent the value for the items grouped on rowsData[ii],
which means that the size of this list should be the same as the size of the rowsData list.
If the sizes are different, for each row, it will be considered that the values were not found, and the cells will be empty.

Autodesk.Revit.DB.ICustomFieldServerProxy.GetCustomFieldValue(System.Collections.Generic.IList{Autodesk.Revit.DB.CustomFieldOneRowData},Autodesk.Revit.DB.ScheduleField)
Override this function to compute the value for the specified items.
Remarks:
This value will be shown in the schedule view. It will also be shown when the schedule is placed on a sheet only if this custom field doesn't have a custom graphic representation
During the execution of this function the document can't be modified
rowsData:
A list where each item represents the data needed for computation for one row.
scheduleField:
The field that is controlled by this server.
Returns:
Returns a list of objects which contains the result of the computation and the computed value.
The object at index ii should represent the value for the items grouped on rowsData[ii]
which means that the size of this list should be the same as the size of the rowsData list.
If the sizes are different, for each row, it will be considered that the values were not found, and the cells will be empty.

Autodesk.Revit.DB.ICustomFieldServerProxy.GetCustomFieldNecessaryData(Autodesk.Revit.DB.ScheduleField)
Override this function to inform Revit about the ids of the elements or categories/subcategories or any specific specs describing
the data type that are needed to compute the value/graphics of this custom field.
This function is called when the field is inserted into a schedule or when field properties were set.
Each time when elements, categories/subcategories with these ids or the specs are changed, the schedule will be recomputed.
If one of the necessary ids will be deleted, there will be posted an error with "Remove Field" resolution.
scheduleField:
The field that is controlled by this server.
Returns:
Returns an object which contains all the necessary data.

Autodesk.Revit.DB.ICustomFieldServerProxy.InitializeCustomFieldData(Autodesk.Revit.DB.ScheduleField)
Override this function to get a notification when the field was added in a schedule.
Remarks:
This is a good place where the default properties for this field can be set.
The View Schedule is an element which can be used to attach and serialize data using Extensible Storage framework.
scheduleField:
The field that is controlled by this server.
The schedule that contains this field is an element which can be used to attach and serialize data using Extensible Storage framework.

Autodesk.Revit.DB.ICustomFieldServerProxy.GetCustomFieldInformation
Override this function and return the information about the custom field.
Returns:
Returns an object which contains all the custom field information.